
/*
这个script是用来在WSA上面玩Phigros的按键绑定设置
需要配合AutoHotKey2.0一起食用~
目前只开发了模拟点击，无长按和滑动操作。（好像也不支持非数值方向的操作……）
欢迎(急需)补充和扩展！

此脚本在2560*1600屏幕上使用！
若需要使用其他的屏幕，请自行修改参数。
    <Eg>::{
        MouseClick "left", <x>, 1300, 1, 0.1 ;
    }

计算方法，，，
屏幕长度/11，依次乘以1，2，3，4……得到对应数值，填入即可。

*/




1::{
    MouseClick "left", 213, 1300, 1, 0.1 ;
}

2::{
    MouseClick "left", 426, 1300, 1, 0.1 ;
}

3::{
    MouseClick  "left", 639, 1300, 1, 0.1 ;
}

4::{
    MouseClick  "left", 852, 1300, 1, 0.1 ;
}

5::{
    MouseClick  "left", 1065, 1300, 1, 0.1 ;
}

6::{
    MouseClick  "left", 1278, 1300, 1, 0.1 ;
}

7::{
    MouseClick "left", 1491, 1300, 1, 0.1 ;
}

8::{
    MouseClick "left", 1704, 1300, 1, 0.1 ;
}
9::{
    MouseClick "left", 1917, 1300, 1, 0.1 ;
}

0::{
    MouseClick "left", 2130, 1300, 1, 0.1 ;
}

-::{
    MouseClick "left", 2343, 1300, 1, 0.1 ;
}

/*
    烂透了这代码！小学生都能写。。。（官方吐槽）
*/
